selenium/feature_tests/src/test/resources/testfiles/genricReportingUAE/exportFailure.xml

<?xml version="1.0" encoding="utf-8"?>
<soapenv:Envelope
        xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
        xmlns:cxf="http://cxf.component.camel.apache.org/">
    <soapenv:Header />
    <soapenv:Body>
        <n1:envelope
                xmlns:n1="http://www.sap.com/sap_ich4ls/"
                xmlns:prx="urn:sap.com:proxy:Y21:/1SAI/TAS8FB8FF2B37F00B51AA2D:740"
                xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/">
            <message date="2022-07-14" time="07:53:37">
                <id>42010AEECDE11EED90F61F0E9EB6A764</id>
            </message>
            <sender agency="GS1" scheme="GLN">0355801000002</sender>
            <recipients>
                <id agency="SAP" scheme="RegReport">RR_SA_ICH_EXPORT</id>
            </recipients>
            <content encoding="XML" format="ATTP" type="GenericReporting" version="1.0">
                <ATTPGRDocument>
                    <GRHeader>
                        <GRHeaderBase>
                            <ReceiverId>RR_SA_ICH_EXPORT</ReceiverId>
                            <InstanceId>42010AEECDE11EED90F61F0E9EB6A764</InstanceId>
                            <DateTime>2022-10-04T06:51:28Z</DateTime>
                            <VariantName>RR_SA_EXPORT</VariantName>
                            <VariantVersion>1 </VariantVersion>
                        </GRHeaderBase>
                        <ContentList>
                            <Content type="BusinessPartner">
                                <ContentItem id="92-ICH: Saudi Arabia CUST 1" selectionMethod="DestLocGLN">
                                    <ContentItemSection type="Address">
                                        <ContentItemSectionItem>
                                            <attribute id="sttpBupAdrCountry">SA</attribute>
                                        </ContentItemSectionItem>
                                    </ContentItemSection>
                                </ContentItem>
                            </Content>
                        </ContentList>
                    </GRHeader>
                    <GRBody>
                        <ObjContentList>
                            <ObjContent type="LotRefList">
                                <ObjContentGroup>
                                    <ObjCode id="011122334455667510SFDAQOSAIBI1826" type="LGTIN" dateManuf="2021-10-04" dateExp="2020-10-04"/>
                                </ObjContentGroup>
                            </ObjContent>
                            <ObjContent type="SGTINList">
                                <ObjContentGroup>
                                    <ObjCode id="011122334455667521CLXPTA8Y41P" type="SGTIN" lotRef="SFDAQOSAIBI1826"/>
                                    <ObjCode id="011122334455667521CLXPTA8Y41P" type="SGTIN" lotRef="SFDAQOSAIBI1826"/>
                                </ObjContentGroup>
                            </ObjContent>
                        </ObjContentList>
                    </GRBody>
                </ATTPGRDocument>
            </content>
        </n1:envelope>
    </soapenv:Body>
</soapenv:Envelope>